Analyse of bikeshare.metro.net

In [2]:
import pandas as pd

stationData = pd.read_csv(
    'data/metro-bike-share-stations-2025-04-01.csv',
    encoding='latin-1'
)

stationData.columns.str.strip()

Index(['Kiosk ID', 'Kiosk Name', 'Go Live Date', 'Region', 'Status',
       'Latitude', 'Longitude', 'status2'],
      dtype='object')

In [3]:
active_vehicle= stationData[stationData['Status'] == 'Active']
inactive_vehicle = stationData[stationData['Status'] == 'Inactive']

# Count the number of active vehicles   
num= active_vehicle['Status'].count()
print(f'The number of active vehicles is: {num}')

active_vehicle

The number of active vehicles is: 221

,Kiosk ID,Kiosk Name,Go Live Date,Region,Status,Latitude,Longitude,status2
0,3000,Virtual Station,7/7/2016,NaN,Active,0.000000,0.000000,#REF!
1,3005,7th & Flower,7/7/2016,DTLA,Active,34.048500,-118.258537,#REF!
2,3006,Olive & 8th,7/7/2016,DTLA,Active,34.045540,-118.256668,#REF!
3,3007,5th & Grand,7/7/2016,DTLA,Active,34.050480,-118.254593,#REF!
4,3008,Figueroa & 9th,7/7/2016,DTLA,Active,34.046612,-118.262733,#REF!
...,...,...,...,...,...,...,...,...
416,4672,7th & Broadway,5/23/2024,DTLA,Active,34.045021,-118.253189,#REF!
420,4680,Broadway & 8th,7/10/2024,DTLA,Active,34.043522,-118.255089,#REF!
421,4682,CicLAvia Meet the Hollywood's - West Hollywood...,8/18/2024,NaN,Active,34.085640,-118.382790,#REF!
425,4689,University Village (Sepulveda Blvd),10/9/2024,Westside,Active,34.023849,-118.426071,#REF!
426,4690,Vineland & Burbank,12/19/2024,North Hollywood,Active,34.172451,-118.370369,#REF!

Active Vehicles grouped by Region

In [4]:
active_vehicle.columns = active_vehicle.columns.str.strip()
counts = (
    active_vehicle
      .groupby('Region')
      .size()
      .reset_index(name='active_count')
)
counts

            Region  active_count
0             DTLA           143
1  North Hollywood            12
2         Westside            64

In [5]:
inactive_vehicle.columns = inactive_vehicle.columns.str.strip()
counts = (
    inactive_vehicle
      .groupby('Region')
      .size()
      .reset_index(name='inactive_count')
)
counts

            Region  inactive_count
0             DTLA              59
1       Free Bikes               2
2  North Hollywood              24
3         Pasadena              31
4       Port of LA              13
5         Westside              79

Verschiedene Regionen

In [6]:
regions = (
    inactive_vehicle
      .groupby('Region')
      .size()
      .reset_index(name='inactive_count')
)
regions

            Region  inactive_count
0             DTLA              59
1       Free Bikes               2
2  North Hollywood              24
3         Pasadena              31
4       Port of LA              13
5         Westside              79

Trip Data

In [9]:
tripData = pd.read_csv(
    'data/metro-trips-2025-q1.csv',
    encoding='latin-1'
)

tripData.columns=tripData.columns.str.strip()

tripData

,trip_id,duration,start_time,end_time,start_station,start_lat,start_lon,end_station,end_lat,end_lon,bike_id,plan_duration,trip_route_category,passholder_type,bike_type
0,475609834,5,1/1/2025 0:12,1/1/2025 0:17,3030,34.051941,-118.243530,4491,34.047440,-118.247940,13668,30,One Way,Monthly Pass,standard
1,475609846,7,1/1/2025 0:12,1/1/2025 0:19,4558,34.025688,-118.395302,4569,34.026550,-118.408463,30021,30,One Way,Monthly Pass,electric
2,475609903,11,1/1/2025 0:13,1/1/2025 0:24,4212,33.988129,-118.471741,4206,33.998341,-118.461014,14923,30,One Way,Monthly Pass,standard
3,475609904,11,1/1/2025 0:13,1/1/2025 0:24,4212,33.988129,-118.471741,4206,33.998341,-118.461014,26704,30,One Way,Monthly Pass,electric
4,475610048,13,1/1/2025 0:27,1/1/2025 0:40,4472,34.092602,-118.280930,4509,34.101639,-118.309174,14790,30,One Way,Monthly Pass,standard
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95911,497792778,13,3/31/2025 23:43,3/31/2025 23:56,3022,34.046070,-118.233093,4680,34.043522,-118.255089,13669,30,One Way,Monthly Pass,standard
95912,497792596,7,3/31/2025 23:44,3/31/2025 23:51,4643,34.072620,-118.449440,4528,34.060970,-118.444366,25531,30,One Way,Monthly Pass,electric
95913,497792744,6,3/31/2025 23:49,3/31/2025 23:55,3026,34.063179,-118.245880,4445,34.073639,-118.251572,29109,30,One Way,Monthly Pass,electric
95914,497826163,623,3/31/2025 23:56,4/1/2025 10:19,3035,34.048401,-118.260948,3077,34.039871,-118.250038,5755,365,One Way,Annual Pass,standard
95915,497794483,17,3/31/2025 23:59,4/1/2025 0:16,4584,34.094349,-118.326363,4534,34.101860,-118.328110,23041,30,One Way,Monthly Pass,electric

In [14]:
meantime=tripData['duration'].mean()
meantime

np.float64(29.596250886192085)